tutorials/surfaceTracking/interTrackFoam/ramp/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-4 0 0)
    ( 0 0 0)
    ( 0 1 0)
    (-4 1 0)

    (-4 0 0.1)
    ( 0 0 0.1)
    ( 0 1 0.1)
    (-4 1 0.1)

    (1 0.2 0)
    (1 1 0)

    (1 0.2 0.1)
    (1 1 0.1)

    (5 0.2 0)
    (5 1 0)

    (5 0.2 0.1)
    (5 1 0.1)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 10 1) simpleGrading (0.3 1 1)
    hex (1 8 9 2 5 10 11 6) (10 10 1) simpleGrading (1 1 1)
    hex (8 12 13 9 10 14 15 11) (20 10 1) simpleGrading (3.33 1 1)
);

edges
(
);

patches
(
    wall freeSurface
    (
        (3 7 6 2)
        (2 6 11 9)
        (9 11 15 13)
    )
    wall inlet
    (
        (0 4 7 3)
    )
    wall outlet
    (
        (12 13 15 14)
    )
    wall walls
    (
        (5 4 0 1)
        (10 5 1 8)
        (14 10 8 12)
    )
    empty frontAndBack
    (
        (0 3 2 1)
        (4 5 6 7)
        (1 2 9 8)
        (5 10 11 6)
        (8 9 13 12)
        (10 14 15 11)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
